RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPBPUD register
//
//*****************************************************************************
#define GPIO_GPBPUD_GPIO32        0x1         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO33        0x2         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO34        0x4         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO35        0x8         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO36        0x10        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO37        0x20        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO38        0x40        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO39        0x80        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO40        0x100       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO41        0x200       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO42        0x400       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO43        0x800       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO44        0x1000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO45        0x2000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO46        0x4000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO47        0x8000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO48        0x10000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO49        0x20000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO50        0x40000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO51        0x80000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO52        0x100000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO53        0x200000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO54        0x400000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO55        0x800000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO56        0x1000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO57        0x2000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO58        0x4000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO59        0x8000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO60        0x10000000  // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO61        0x20000000  // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO62        0x40000000  // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPBPUD_GPIO63        0x80000000  // Pull-Up Disable control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBINV register
//
//*****************************************************************************
#define GPIO_GPBINV_GPIO32        0x1         // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO33        0x2         // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO34        0x4         // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO35        0x8         // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO36        0x10        // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO37        0x20        // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO38        0x40        // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO39        0x80        // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO40        0x100       // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO41        0x200       // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO42        0x400       // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO43        0x800       // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO44        0x1000      // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO45        0x2000      // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO46        0x4000      // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO47        0x8000      // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO48        0x10000     // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO49        0x20000     // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO50        0x40000     // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO51        0x80000     // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO52        0x100000    // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO53        0x200000    // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO54        0x400000    // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO55        0x800000    // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO56        0x1000000   // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO57        0x2000000   // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO58        0x4000000   // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO59        0x8000000   // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO60        0x10000000  // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO61        0x20000000  // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO62        0x40000000  // Input inversion control for
                                              // this pin
#define GPIO_GPBINV_GPIO63        0x80000000  // Input inversion control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBODR register
//
//*****************************************************************************
#define GPIO_GPBODR_GPIO32        0x1         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO33        0x2         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO34        0x4         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO35        0x8         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO36        0x10        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO37        0x20        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO38        0x40        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO39        0x80        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO40        0x100       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO41        0x200       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO42        0x400       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO43        0x800       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO44        0x1000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO45        0x2000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO46        0x4000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO47        0x8000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO48        0x10000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO49        0x20000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO50        0x40000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO51        0x80000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO52        0x100000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO53        0x200000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO54        0x400000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO55        0x800000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO56        0x1000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO57        0x2000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO58        0x4000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO59        0x8000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO60        0x10000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO61        0x20000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO62        0x40000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPBODR_GPIO63        0x80000000  // Outpout Open-Drain control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBAMSEL register
//
//*****************************************************************************
#define GPIO_GPBAMSEL_GPIO42      0x400       // Analog Mode select for this pin
#define GPIO_GPBAMSEL_GPIO43      0x800       // Analog Mode select for this pin
#define GPIO_GPBAMSEL_GPIO46      0x4000      // Analog Mode select for this pin
#define GPIO_GPBAMSEL_GPIO47      0x8000      // Analog Mode select for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBGMUX1 register
//
//*****************************************************************************
#define GPIO_GPBGMUX1_GPIO32_S    0
#define GPIO_GPBGMUX1_GPIO32_M    0x3         // Defines pin-muxing selection
                                              // for GPIO32
#define GPIO_GPBGMUX1_GPIO33_S    2
#define GPIO_GPBGMUX1_GPIO33_M    0xC         // Defines pin-muxing selection
                                              // for GPIO33
#define GPIO_GPBGMUX1_GPIO34_S    4
#define GPIO_GPBGMUX1_GPIO34_M    0x30        // Defines pin-muxing selection
                                              // for GPIO34
#define GPIO_GPBGMUX1_GPIO35_S    6
#define GPIO_GPBGMUX1_GPIO35_M    0xC0        // Defines pin-muxing selection
                                              // for GPIO35
#define GPIO_GPBGMUX1_GPIO36_S    8
#define GPIO_GPBGMUX1_GPIO36_M    0x300       // Defines pin-muxing selection
                                              // for GPIO36
#define GPIO_GPBGMUX1_GPIO37_S    10
#define GPIO_GPBGMUX1_GPIO37_M    0xC00       // Defines pin-muxing selection
                                              // for GPIO37
#define GPIO_GPBGMUX1_GPIO38_S    12
#define GPIO_GPBGMUX1_GPIO38_M    0x3000      // Defines pin-muxing selection
                                              // for GPIO38
#define GPIO_GPBGMUX1_GPIO39_S    14
#define GPIO_GPBGMUX1_GPIO39_M    0xC000      // Defines pin-muxing selection
                                              // for GPIO39
#define GPIO_GPBGMUX1_GPIO40_S    16
#define GPIO_GPBGMUX1_GPIO40_M    0x30000     // Defines pin-muxing selection
                                              // for GPIO40
#define GPIO_GPBGMUX1_GPIO41_S    18
#define GPIO_GPBGMUX1_GPIO41_M    0xC0000     // Defines pin-muxing selection
                                              // for GPIO41
#define GPIO_GPBGMUX1_GPIO42_S    20
#define GPIO_GPBGMUX1_GPIO42_M    0x300000    // Defines pin-muxing selection
                                              // for GPIO42
#define GPIO_GPBGMUX1_GPIO43_S    22
#define GPIO_GPBGMUX1_GPIO43_M    0xC00000    // Defines pin-muxing selection
                                              // for GPIO43
#define GPIO_GPBGMUX1_GPIO44_S    24
#define GPIO_GPBGMUX1_GPIO44_M    0x3000000   // Defines pin-muxing selection
                                              // for GPIO44
#define GPIO_GPBGMUX1_GPIO45_S    26
#define GPIO_GPBGMUX1_GPIO45_M    0xC000000   // Defines pin-muxing selection
                                              // for GPIO45
#define GPIO_GPBGMUX1_GPIO46_S    28
#define GPIO_GPBGMUX1_GPIO46_M    0x30000000  // Defines pin-muxing selection
                                              // for GPIO46
#define GPIO_GPBGMUX1_GPIO47_S    30
#define GPIO_GPBGMUX1_GPIO47_M    0xC0000000  // Defines pin-muxing selection
                                              // for GPIO47

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBGMUX2 register
//
//*****************************************************************************
#define GPIO_GPBGMUX2_GPIO48_S    0
#define GPIO_GPBGMUX2_GPIO48_M    0x3         // Defines pin-muxing selection
                                              // for GPIO48
#define GPIO_GPBGMUX2_GPIO49_S    2
#define GPIO_GPBGMUX2_GPIO49_M    0xC         // Defines pin-muxing selection
                                              // for GPIO49
#define GPIO_GPBGMUX2_GPIO50_S    4
#define GPIO_GPBGMUX2_GPIO50_M    0x30        // Defines pin-muxing selection
                                              // for GPIO50
#define GPIO_GPBGMUX2_GPIO51_S    6
#define GPIO_GPBGMUX2_GPIO51_M    0xC0        // Defines pin-muxing selection
                                              // for GPIO51
#define GPIO_GPBGMUX2_GPIO52_S    8
#define GPIO_GPBGMUX2_GPIO52_M    0x300       // Defines pin-muxing selection
                                              // for GPIO52
#define GPIO_GPBGMUX2_GPIO53_S    10
#define GPIO_GPBGMUX2_GPIO53_M    0xC00       // Defines pin-muxing selection
                                              // for GPIO53
#define GPIO_GPBGMUX2_GPIO54_S    12
#define GPIO_GPBGMUX2_GPIO54_M    0x3000      // Defines pin-muxing selection
                                              // for GPIO54
#define GPIO_GPBGMUX2_GPIO55_S    14
#define GPIO_GPBGMUX2_GPIO55_M    0xC000      // Defines pin-muxing selection
                                              // for GPIO55
#define GPIO_GPBGMUX2_GPIO56_S    16
#define GPIO_GPBGMUX2_GPIO56_M    0x30000     // Defines pin-muxing selection
                                              // for GPIO56
#define GPIO_GPBGMUX2_GPIO57_S    18
#define GPIO_GPBGMUX2_GPIO57_M    0xC0000     // Defines pin-muxing selection
                                              // for GPIO57
#define GPIO_GPBGMUX2_GPIO58_S    20
#define GPIO_GPBGMUX2_GPIO58_M    0x300000    // Defines pin-muxing selection
                                              // for GPIO58
#define GPIO_GPBGMUX2_GPIO59_S    22
#define GPIO_GPBGMUX2_GPIO59_M    0xC00000    // Defines pin-muxing selection
                                              // for GPIO59
#define GPIO_GPBGMUX2_GPIO60_S    24
#define GPIO_GPBGMUX2_GPIO60_M    0x3000000   // Defines pin-muxing selection
                                              // for GPIO60
#define GPIO_GPBGMUX2_GPIO61_S    26
#define GPIO_GPBGMUX2_GPIO61_M    0xC000000   // Defines pin-muxing selection
                                              // for GPIO61
#define GPIO_GPBGMUX2_GPIO62_S    28
#define GPIO_GPBGMUX2_GPIO62_M    0x30000000  // Defines pin-muxing selection
                                              // for GPIO62
#define GPIO_GPBGMUX2_GPIO63_S    30
#define GPIO_GPBGMUX2_GPIO63_M    0xC0000000  // Defines pin-muxing selection
                                              // for GPIO63

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL1 register
//
//*****************************************************************************
#define GPIO_GPBCSEL1_GPIO32_S    0
#define GPIO_GPBCSEL1_GPIO32_M    0xF         // GPIO32 Master CPU Select
#define GPIO_GPBCSEL1_GPIO33_S    4
#define GPIO_GPBCSEL1_GPIO33_M    0xF0        // GPIO33 Master CPU Select
#define GPIO_GPBCSEL1_GPIO34_S    8
#define GPIO_GPBCSEL1_GPIO34_M    0xF00       // GPIO34 Master CPU Select
#define GPIO_GPBCSEL1_GPIO35_S    12
#define GPIO_GPBCSEL1_GPIO35_M    0xF000      // GPIO35 Master CPU Select
#define GPIO_GPBCSEL1_GPIO36_S    16
#define GPIO_GPBCSEL1_GPIO36_M    0xF0000     // GPIO36 Master CPU Select
#define GPIO_GPBCSEL1_GPIO37_S    20
#define GPIO_GPBCSEL1_GPIO37_M    0xF00000    // GPIO37 Master CPU Select
#define GPIO_GPBCSEL1_GPIO38_S    24
#define GPIO_GPBCSEL1_GPIO38_M    0xF000000   // GPIO38 Master CPU Select
#define GPIO_GPBCSEL1_GPIO39_S    28
#define GPIO_GPBCSEL1_GPIO39_M    0xF0000000  // GPIO39 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL2 register
//
//*****************************************************************************
#define GPIO_GPBCSEL2_GPIO40_S    0
#define GPIO_GPBCSEL2_GPIO40_M    0xF         // GPIO40 Master CPU Select
#define GPIO_GPBCSEL2_GPIO41_S    4
#define GPIO_GPBCSEL2_GPIO41_M    0xF0        // GPIO41 Master CPU Select
#define GPIO_GPBCSEL2_GPIO42_S    8
#define GPIO_GPBCSEL2_GPIO42_M    0xF00       // GPIO42 Master CPU Select
#define GPIO_GPBCSEL2_GPIO43_S    12
#define GPIO_GPBCSEL2_GPIO43_M    0xF000      // GPIO43 Master CPU Select
#define GPIO_GPBCSEL2_GPIO44_S    16
#define GPIO_GPBCSEL2_GPIO44_M    0xF0000     // GPIO44 Master CPU Select
#define GPIO_GPBCSEL2_GPIO45_S    20
#define GPIO_GPBCSEL2_GPIO45_M    0xF00000    // GPIO45 Master CPU Select
#define GPIO_GPBCSEL2_GPIO46_S    24
#define GPIO_GPBCSEL2_GPIO46_M    0xF000000   // GPIO46 Master CPU Select
#define GPIO_GPBCSEL2_GPIO47_S    28
#define GPIO_GPBCSEL2_GPIO47_M    0xF0000000  // GPIO47 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL3 register
//
//*****************************************************************************
#define GPIO_GPBCSEL3_GPIO48_S    0
#define GPIO_GPBCSEL3_GPIO48_M    0xF         // GPIO48 Master CPU Select
#define GPIO_GPBCSEL3_GPIO49_S    4
#define GPIO_GPBCSEL3_GPIO49_M    0xF0        // GPIO49 Master CPU Select
#define GPIO_GPBCSEL3_GPIO50_S    8
#define GPIO_GPBCSEL3_GPIO50_M    0xF00       // GPIO50 Master CPU Select
#define GPIO_GPBCSEL3_GPIO51_S    12
#define GPIO_GPBCSEL3_GPIO51_M    0xF000      // GPIO51 Master CPU Select
#define GPIO_GPBCSEL3_GPIO52_S    16
#define GPIO_GPBCSEL3_GPIO52_M    0xF0000     // GPIO52 Master CPU Select
#define GPIO_GPBCSEL3_GPIO53_S    20
#define GPIO_GPBCSEL3_GPIO53_M    0xF00000    // GPIO53 Master CPU Select
#define GPIO_GPBCSEL3_GPIO54_S    24
#define GPIO_GPBCSEL3_GPIO54_M    0xF000000   // GPIO54 Master CPU Select
#define GPIO_GPBCSEL3_GPIO55_S    28
#define GPIO_GPBCSEL3_GPIO55_M    0xF0000000  // GPIO55 Master CPU Select

