RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPEPUD register
//
//*****************************************************************************
#define GPIO_GPEPUD_GPIO128       0x1         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO129       0x2         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO130       0x4         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO131       0x8         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO132       0x10        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO133       0x20        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO134       0x40        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO135       0x80        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO136       0x100       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO137       0x200       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO138       0x400       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO139       0x800       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO140       0x1000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO141       0x2000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO142       0x4000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO143       0x8000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO144       0x10000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO145       0x20000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO146       0x40000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO147       0x80000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO148       0x100000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO149       0x200000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO150       0x400000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO151       0x800000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO152       0x1000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO153       0x2000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO154       0x4000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO155       0x8000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO156       0x10000000  // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO157       0x20000000  // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO158       0x40000000  // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPEPUD_GPIO159       0x80000000  // Pull-Up Disable control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEINV register
//
//*****************************************************************************
#define GPIO_GPEINV_GPIO128       0x1         // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO129       0x2         // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO130       0x4         // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO131       0x8         // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO132       0x10        // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO133       0x20        // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO134       0x40        // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO135       0x80        // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO136       0x100       // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO137       0x200       // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO138       0x400       // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO139       0x800       // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO140       0x1000      // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO141       0x2000      // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO142       0x4000      // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO143       0x8000      // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO144       0x10000     // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO145       0x20000     // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO146       0x40000     // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO147       0x80000     // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO148       0x100000    // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO149       0x200000    // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO150       0x400000    // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO151       0x800000    // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO152       0x1000000   // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO153       0x2000000   // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO154       0x4000000   // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO155       0x8000000   // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO156       0x10000000  // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO157       0x20000000  // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO158       0x40000000  // Input inversion control for
                                              // this pin
#define GPIO_GPEINV_GPIO159       0x80000000  // Input inversion control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEODR register
//
//*****************************************************************************
#define GPIO_GPEODR_GPIO128       0x1         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO129       0x2         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO130       0x4         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO131       0x8         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO132       0x10        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO133       0x20        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO134       0x40        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO135       0x80        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO136       0x100       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO137       0x200       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO138       0x400       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO139       0x800       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO140       0x1000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO141       0x2000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO142       0x4000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO143       0x8000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO144       0x10000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO145       0x20000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO146       0x40000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO147       0x80000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO148       0x100000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO149       0x200000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO150       0x400000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO151       0x800000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO152       0x1000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO153       0x2000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO154       0x4000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO155       0x8000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO156       0x10000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO157       0x20000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO158       0x40000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPEODR_GPIO159       0x80000000  // Outpout Open-Drain control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEGMUX1 register
//
//*****************************************************************************
#define GPIO_GPEGMUX1_GPIO128_S   0
#define GPIO_GPEGMUX1_GPIO128_M   0x3         // Defines pin-muxing selection
                                              // for GPIO128
#define GPIO_GPEGMUX1_GPIO129_S   2
#define GPIO_GPEGMUX1_GPIO129_M   0xC         // Defines pin-muxing selection
                                              // for GPIO129
#define GPIO_GPEGMUX1_GPIO130_S   4
#define GPIO_GPEGMUX1_GPIO130_M   0x30        // Defines pin-muxing selection
                                              // for GPIO130
#define GPIO_GPEGMUX1_GPIO131_S   6
#define GPIO_GPEGMUX1_GPIO131_M   0xC0        // Defines pin-muxing selection
                                              // for GPIO131
#define GPIO_GPEGMUX1_GPIO132_S   8
#define GPIO_GPEGMUX1_GPIO132_M   0x300       // Defines pin-muxing selection
                                              // for GPIO132
#define GPIO_GPEGMUX1_GPIO133_S   10
#define GPIO_GPEGMUX1_GPIO133_M   0xC00       // Defines pin-muxing selection
                                              // for GPIO133
#define GPIO_GPEGMUX1_GPIO134_S   12
#define GPIO_GPEGMUX1_GPIO134_M   0x3000      // Defines pin-muxing selection
                                              // for GPIO134
#define GPIO_GPEGMUX1_GPIO135_S   14
#define GPIO_GPEGMUX1_GPIO135_M   0xC000      // Defines pin-muxing selection
                                              // for GPIO135
#define GPIO_GPEGMUX1_GPIO136_S   16
#define GPIO_GPEGMUX1_GPIO136_M   0x30000     // Defines pin-muxing selection
                                              // for GPIO136
#define GPIO_GPEGMUX1_GPIO137_S   18
#define GPIO_GPEGMUX1_GPIO137_M   0xC0000     // Defines pin-muxing selection
                                              // for GPIO137
#define GPIO_GPEGMUX1_GPIO138_S   20
#define GPIO_GPEGMUX1_GPIO138_M   0x300000    // Defines pin-muxing selection
                                              // for GPIO138
#define GPIO_GPEGMUX1_GPIO139_S   22
#define GPIO_GPEGMUX1_GPIO139_M   0xC00000    // Defines pin-muxing selection
                                              // for GPIO139
#define GPIO_GPEGMUX1_GPIO140_S   24
#define GPIO_GPEGMUX1_GPIO140_M   0x3000000   // Defines pin-muxing selection
                                              // for GPIO140
#define GPIO_GPEGMUX1_GPIO141_S   26
#define GPIO_GPEGMUX1_GPIO141_M   0xC000000   // Defines pin-muxing selection
                                              // for GPIO141
#define GPIO_GPEGMUX1_GPIO142_S   28
#define GPIO_GPEGMUX1_GPIO142_M   0x30000000  // Defines pin-muxing selection
                                              // for GPIO142
#define GPIO_GPEGMUX1_GPIO143_S   30
#define GPIO_GPEGMUX1_GPIO143_M   0xC0000000  // Defines pin-muxing selection
                                              // for GPIO143

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEGMUX2 register
//
//*****************************************************************************
#define GPIO_GPEGMUX2_GPIO144_S   0
#define GPIO_GPEGMUX2_GPIO144_M   0x3         // Defines pin-muxing selection
                                              // for GPIO144
#define GPIO_GPEGMUX2_GPIO145_S   2
#define GPIO_GPEGMUX2_GPIO145_M   0xC         // Defines pin-muxing selection
                                              // for GPIO145
#define GPIO_GPEGMUX2_GPIO146_S   4
#define GPIO_GPEGMUX2_GPIO146_M   0x30        // Defines pin-muxing selection
                                              // for GPIO146
#define GPIO_GPEGMUX2_GPIO147_S   6
#define GPIO_GPEGMUX2_GPIO147_M   0xC0        // Defines pin-muxing selection
                                              // for GPIO147
#define GPIO_GPEGMUX2_GPIO148_S   8
#define GPIO_GPEGMUX2_GPIO148_M   0x300       // Defines pin-muxing selection
                                              // for GPIO148
#define GPIO_GPEGMUX2_GPIO149_S   10
#define GPIO_GPEGMUX2_GPIO149_M   0xC00       // Defines pin-muxing selection
                                              // for GPIO149
#define GPIO_GPEGMUX2_GPIO150_S   12
#define GPIO_GPEGMUX2_GPIO150_M   0x3000      // Defines pin-muxing selection
                                              // for GPIO150
#define GPIO_GPEGMUX2_GPIO151_S   14
#define GPIO_GPEGMUX2_GPIO151_M   0xC000      // Defines pin-muxing selection
                                              // for GPIO151
#define GPIO_GPEGMUX2_GPIO152_S   16
#define GPIO_GPEGMUX2_GPIO152_M   0x30000     // Defines pin-muxing selection
                                              // for GPIO152
#define GPIO_GPEGMUX2_GPIO153_S   18
#define GPIO_GPEGMUX2_GPIO153_M   0xC0000     // Defines pin-muxing selection
                                              // for GPIO153
#define GPIO_GPEGMUX2_GPIO154_S   20
#define GPIO_GPEGMUX2_GPIO154_M   0x300000    // Defines pin-muxing selection
                                              // for GPIO154
#define GPIO_GPEGMUX2_GPIO155_S   22
#define GPIO_GPEGMUX2_GPIO155_M   0xC00000    // Defines pin-muxing selection
                                              // for GPIO155
#define GPIO_GPEGMUX2_GPIO156_S   24
#define GPIO_GPEGMUX2_GPIO156_M   0x3000000   // Defines pin-muxing selection
                                              // for GPIO156
#define GPIO_GPEGMUX2_GPIO157_S   26
#define GPIO_GPEGMUX2_GPIO157_M   0xC000000   // Defines pin-muxing selection
                                              // for GPIO157
#define GPIO_GPEGMUX2_GPIO158_S   28
#define GPIO_GPEGMUX2_GPIO158_M   0x30000000  // Defines pin-muxing selection
                                              // for GPIO158
#define GPIO_GPEGMUX2_GPIO159_S   30
#define GPIO_GPEGMUX2_GPIO159_M   0xC0000000  // Defines pin-muxing selection
                                              // for GPIO159

//*****************************************************************************
//
// The following are defines for the bit fields in the GPECSEL1 register
//
//*****************************************************************************
#define GPIO_GPECSEL1_GPIO128_S   0
#define GPIO_GPECSEL1_GPIO128_M   0xF         // GPIO128 Master CPU Select
#define GPIO_GPECSEL1_GPIO129_S   4
#define GPIO_GPECSEL1_GPIO129_M   0xF0        // GPIO129 Master CPU Select
#define GPIO_GPECSEL1_GPIO130_S   8
#define GPIO_GPECSEL1_GPIO130_M   0xF00       // GPIO130 Master CPU Select
#define GPIO_GPECSEL1_GPIO131_S   12
#define GPIO_GPECSEL1_GPIO131_M   0xF000      // GPIO131 Master CPU Select
#define GPIO_GPECSEL1_GPIO132_S   16
#define GPIO_GPECSEL1_GPIO132_M   0xF0000     // GPIO132 Master CPU Select
#define GPIO_GPECSEL1_GPIO133_S   20
#define GPIO_GPECSEL1_GPIO133_M   0xF00000    // GPIO133 Master CPU Select
#define GPIO_GPECSEL1_GPIO134_S   24
#define GPIO_GPECSEL1_GPIO134_M   0xF000000   // GPIO134 Master CPU Select
#define GPIO_GPECSEL1_GPIO135_S   28
#define GPIO_GPECSEL1_GPIO135_M   0xF0000000  // GPIO135 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPECSEL2 register
//
//*****************************************************************************
#define GPIO_GPECSEL2_GPIO136_S   0
#define GPIO_GPECSEL2_GPIO136_M   0xF         // GPIO136 Master CPU Select
#define GPIO_GPECSEL2_GPIO137_S   4
#define GPIO_GPECSEL2_GPIO137_M   0xF0        // GPIO137 Master CPU Select
#define GPIO_GPECSEL2_GPIO138_S   8
#define GPIO_GPECSEL2_GPIO138_M   0xF00       // GPIO138 Master CPU Select
#define GPIO_GPECSEL2_GPIO139_S   12
#define GPIO_GPECSEL2_GPIO139_M   0xF000      // GPIO139 Master CPU Select
#define GPIO_GPECSEL2_GPIO140_S   16
#define GPIO_GPECSEL2_GPIO140_M   0xF0000     // GPIO140 Master CPU Select
#define GPIO_GPECSEL2_GPIO141_S   20
#define GPIO_GPECSEL2_GPIO141_M   0xF00000    // GPIO141 Master CPU Select
#define GPIO_GPECSEL2_GPIO142_S   24
#define GPIO_GPECSEL2_GPIO142_M   0xF000000   // GPIO142 Master CPU Select
#define GPIO_GPECSEL2_GPIO143_S   28
#define GPIO_GPECSEL2_GPIO143_M   0xF0000000  // GPIO143 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPECSEL3 register
//
//*****************************************************************************
#define GPIO_GPECSEL3_GPIO144_S   0
#define GPIO_GPECSEL3_GPIO144_M   0xF         // GPIO144 Master CPU Select
#define GPIO_GPECSEL3_GPIO145_S   4
#define GPIO_GPECSEL3_GPIO145_M   0xF0        // GPIO145 Master CPU Select
#define GPIO_GPECSEL3_GPIO146_S   8
#define GPIO_GPECSEL3_GPIO146_M   0xF00       // GPIO146 Master CPU Select
#define GPIO_GPECSEL3_GPIO147_S   12
#define GPIO_GPECSEL3_GPIO147_M   0xF000      // GPIO147 Master CPU Select
#define GPIO_GPECSEL3_GPIO148_S   16
#define GPIO_GPECSEL3_GPIO148_M   0xF0000     // GPIO148 Master CPU Select
#define GPIO_GPECSEL3_GPIO149_S   20
#define GPIO_GPECSEL3_GPIO149_M   0xF00000    // GPIO149 Master CPU Select
#define GPIO_GPECSEL3_GPIO150_S   24
#define GPIO_GPECSEL3_GPIO150_M   0xF000000   // GPIO150 Master CPU Select
#define GPIO_GPECSEL3_GPIO151_S   28
#define GPIO_GPECSEL3_GPIO151_M   0xF0000000  // GPIO151 Master CPU Select

