RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPECSEL4 register
//
//*****************************************************************************
#define GPIO_GPECSEL4_GPIO152_S   0
#define GPIO_GPECSEL4_GPIO152_M   0xF         // GPIO152 Master CPU Select
#define GPIO_GPECSEL4_GPIO153_S   4
#define GPIO_GPECSEL4_GPIO153_M   0xF0        // GPIO153 Master CPU Select
#define GPIO_GPECSEL4_GPIO154_S   8
#define GPIO_GPECSEL4_GPIO154_M   0xF00       // GPIO154 Master CPU Select
#define GPIO_GPECSEL4_GPIO155_S   12
#define GPIO_GPECSEL4_GPIO155_M   0xF000      // GPIO155 Master CPU Select
#define GPIO_GPECSEL4_GPIO156_S   16
#define GPIO_GPECSEL4_GPIO156_M   0xF0000     // GPIO156 Master CPU Select
#define GPIO_GPECSEL4_GPIO157_S   20
#define GPIO_GPECSEL4_GPIO157_M   0xF00000    // GPIO157 Master CPU Select
#define GPIO_GPECSEL4_GPIO158_S   24
#define GPIO_GPECSEL4_GPIO158_M   0xF000000   // GPIO158 Master CPU Select
#define GPIO_GPECSEL4_GPIO159_S   28
#define GPIO_GPECSEL4_GPIO159_M   0xF0000000  // GPIO159 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPELOCK register
//
//*****************************************************************************
#define GPIO_GPELOCK_GPIO128      0x1         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO129      0x2         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO130      0x4         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO131      0x8         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO132      0x10        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO133      0x20        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO134      0x40        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO135      0x80        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO136      0x100       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO137      0x200       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO138      0x400       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO139      0x800       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO140      0x1000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO141      0x2000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO142      0x4000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO143      0x8000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO144      0x10000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO145      0x20000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO146      0x40000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO147      0x80000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO148      0x100000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO149      0x200000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO150      0x400000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO151      0x800000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO152      0x1000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO153      0x2000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO154      0x4000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO155      0x8000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO156      0x10000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO157      0x20000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO158      0x40000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPELOCK_GPIO159      0x80000000  // Configuration Lock bit for this
                                              // pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPECR register
//
//*****************************************************************************
#define GPIO_GPECR_GPIO128        0x1         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO129        0x2         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO130        0x4         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO131        0x8         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO132        0x10        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO133        0x20        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO134        0x40        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO135        0x80        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO136        0x100       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO137        0x200       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO138        0x400       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO139        0x800       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO140        0x1000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO141        0x2000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO142        0x4000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO143        0x8000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO144        0x10000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO145        0x20000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO146        0x40000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO147        0x80000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO148        0x100000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO149        0x200000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO150        0x400000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO151        0x800000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO152        0x1000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO153        0x2000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO154        0x4000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO155        0x8000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO156        0x10000000  // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO157        0x20000000  // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO158        0x40000000  // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPECR_GPIO159        0x80000000  // Configuration lock commit bit
                                              // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCTRL register
//
//*****************************************************************************
#define GPIO_GPFCTRL_QUALPRD0_S   0
#define GPIO_GPFCTRL_QUALPRD0_M   0xFF        // Qualification sampling period
                                              // for GPIO160 to GPIO167
#define GPIO_GPFCTRL_QUALPRD1_S   8
#define GPIO_GPFCTRL_QUALPRD1_M   0xFF00      // Qualification sampling period
                                              // for GPIO168

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFQSEL1 register
//
//*****************************************************************************
#define GPIO_GPFQSEL1_GPIO160_S   0
#define GPIO_GPFQSEL1_GPIO160_M   0x3         // Select input qualification type
                                              // for GPIO160
#define GPIO_GPFQSEL1_GPIO161_S   2
#define GPIO_GPFQSEL1_GPIO161_M   0xC         // Select input qualification type
                                              // for GPIO161
#define GPIO_GPFQSEL1_GPIO162_S   4
#define GPIO_GPFQSEL1_GPIO162_M   0x30        // Select input qualification type
                                              // for GPIO162
#define GPIO_GPFQSEL1_GPIO163_S   6
#define GPIO_GPFQSEL1_GPIO163_M   0xC0        // Select input qualification type
                                              // for GPIO163
#define GPIO_GPFQSEL1_GPIO164_S   8
#define GPIO_GPFQSEL1_GPIO164_M   0x300       // Select input qualification type
                                              // for GPIO164
#define GPIO_GPFQSEL1_GPIO165_S   10
#define GPIO_GPFQSEL1_GPIO165_M   0xC00       // Select input qualification type
                                              // for GPIO165
#define GPIO_GPFQSEL1_GPIO166_S   12
#define GPIO_GPFQSEL1_GPIO166_M   0x3000      // Select input qualification type
                                              // for GPIO166
#define GPIO_GPFQSEL1_GPIO167_S   14
#define GPIO_GPFQSEL1_GPIO167_M   0xC000      // Select input qualification type
                                              // for GPIO167
#define GPIO_GPFQSEL1_GPIO168_S   16
#define GPIO_GPFQSEL1_GPIO168_M   0x30000     // Select input qualification type
                                              // for GPIO168

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFMUX1 register
//
//*****************************************************************************
#define GPIO_GPFMUX1_GPIO160_S    0
#define GPIO_GPFMUX1_GPIO160_M    0x3         // Defines pin-muxing selection
                                              // for GPIO160
#define GPIO_GPFMUX1_GPIO161_S    2
#define GPIO_GPFMUX1_GPIO161_M    0xC         // Defines pin-muxing selection
                                              // for GPIO161
#define GPIO_GPFMUX1_GPIO162_S    4
#define GPIO_GPFMUX1_GPIO162_M    0x30        // Defines pin-muxing selection
                                              // for GPIO162
#define GPIO_GPFMUX1_GPIO163_S    6
#define GPIO_GPFMUX1_GPIO163_M    0xC0        // Defines pin-muxing selection
                                              // for GPIO163
#define GPIO_GPFMUX1_GPIO164_S    8
#define GPIO_GPFMUX1_GPIO164_M    0x300       // Defines pin-muxing selection
                                              // for GPIO164
#define GPIO_GPFMUX1_GPIO165_S    10
#define GPIO_GPFMUX1_GPIO165_M    0xC00       // Defines pin-muxing selection
                                              // for GPIO165
#define GPIO_GPFMUX1_GPIO166_S    12
#define GPIO_GPFMUX1_GPIO166_M    0x3000      // Defines pin-muxing selection
                                              // for GPIO166
#define GPIO_GPFMUX1_GPIO167_S    14
#define GPIO_GPFMUX1_GPIO167_M    0xC000      // Defines pin-muxing selection
                                              // for GPIO167
#define GPIO_GPFMUX1_GPIO168_S    16
#define GPIO_GPFMUX1_GPIO168_M    0x30000     // Defines pin-muxing selection
                                              // for GPIO168

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFDIR register
//
//*****************************************************************************
#define GPIO_GPFDIR_GPIO160       0x1         // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPFDIR_GPIO161       0x2         // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPFDIR_GPIO162       0x4         // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPFDIR_GPIO163       0x8         // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPFDIR_GPIO164       0x10        // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPFDIR_GPIO165       0x20        // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPFDIR_GPIO166       0x40        // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPFDIR_GPIO167       0x80        // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPFDIR_GPIO168       0x100       // Defines direction for this pin
                                              // in GPIO mode

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFPUD register
//
//*****************************************************************************
#define GPIO_GPFPUD_GPIO160       0x1         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO161       0x2         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO162       0x4         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO163       0x8         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO164       0x10        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO165       0x20        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO166       0x40        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO167       0x80        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPFPUD_GPIO168       0x100       // Pull-Up Disable control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFINV register
//
//*****************************************************************************
#define GPIO_GPFINV_GPIO160       0x1         // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO161       0x2         // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO162       0x4         // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO163       0x8         // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO164       0x10        // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO165       0x20        // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO166       0x40        // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO167       0x80        // Input inversion control for
                                              // this pin
#define GPIO_GPFINV_GPIO168       0x100       // Input inversion control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFODR register
//
//*****************************************************************************
#define GPIO_GPFODR_GPIO160       0x1         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO161       0x2         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO162       0x4         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO163       0x8         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO164       0x10        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO165       0x20        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO166       0x40        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO167       0x80        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPFODR_GPIO168       0x100       // Outpout Open-Drain control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFGMUX1 register
//
//*****************************************************************************
#define GPIO_GPFGMUX1_GPIO160_S   0
#define GPIO_GPFGMUX1_GPIO160_M   0x3         // Defines pin-muxing selection
                                              // for GPIO160
#define GPIO_GPFGMUX1_GPIO161_S   2
#define GPIO_GPFGMUX1_GPIO161_M   0xC         // Defines pin-muxing selection
                                              // for GPIO161
#define GPIO_GPFGMUX1_GPIO162_S   4
#define GPIO_GPFGMUX1_GPIO162_M   0x30        // Defines pin-muxing selection
                                              // for GPIO162
#define GPIO_GPFGMUX1_GPIO163_S   6
#define GPIO_GPFGMUX1_GPIO163_M   0xC0        // Defines pin-muxing selection
                                              // for GPIO163
#define GPIO_GPFGMUX1_GPIO164_S   8
#define GPIO_GPFGMUX1_GPIO164_M   0x300       // Defines pin-muxing selection
                                              // for GPIO164
#define GPIO_GPFGMUX1_GPIO165_S   10
#define GPIO_GPFGMUX1_GPIO165_M   0xC00       // Defines pin-muxing selection
                                              // for GPIO165
#define GPIO_GPFGMUX1_GPIO166_S   12
#define GPIO_GPFGMUX1_GPIO166_M   0x3000      // Defines pin-muxing selection
                                              // for GPIO166
#define GPIO_GPFGMUX1_GPIO167_S   14
#define GPIO_GPFGMUX1_GPIO167_M   0xC000      // Defines pin-muxing selection
                                              // for GPIO167
#define GPIO_GPFGMUX1_GPIO168_S   16
#define GPIO_GPFGMUX1_GPIO168_M   0x30000     // Defines pin-muxing selection
                                              // for GPIO168

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCSEL1 register
//
//*****************************************************************************
#define GPIO_GPFCSEL1_GPIO160_S   0
#define GPIO_GPFCSEL1_GPIO160_M   0xF         // GPIO160 Master CPU Select
#define GPIO_GPFCSEL1_GPIO161_S   4
#define GPIO_GPFCSEL1_GPIO161_M   0xF0        // GPIO161 Master CPU Select
#define GPIO_GPFCSEL1_GPIO162_S   8
#define GPIO_GPFCSEL1_GPIO162_M   0xF00       // GPIO162 Master CPU Select
#define GPIO_GPFCSEL1_GPIO163_S   12
#define GPIO_GPFCSEL1_GPIO163_M   0xF000      // GPIO163 Master CPU Select
#define GPIO_GPFCSEL1_GPIO164_S   16
#define GPIO_GPFCSEL1_GPIO164_M   0xF0000     // GPIO164 Master CPU Select
#define GPIO_GPFCSEL1_GPIO165_S   20
#define GPIO_GPFCSEL1_GPIO165_M   0xF00000    // GPIO165 Master CPU Select
#define GPIO_GPFCSEL1_GPIO166_S   24
#define GPIO_GPFCSEL1_GPIO166_M   0xF000000   // GPIO166 Master CPU Select
#define GPIO_GPFCSEL1_GPIO167_S   28
#define GPIO_GPFCSEL1_GPIO167_M   0xF0000000  // GPIO167 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCSEL2 register
//
//*****************************************************************************
#define GPIO_GPFCSEL2_GPIO168_S   0
#define GPIO_GPFCSEL2_GPIO168_M   0xF         // GPIO168 Master CPU Select

