RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPFLOCK register
//
//*****************************************************************************
#define GPIO_GPFLOCK_GPIO160      0x1         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO161      0x2         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO162      0x4         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO163      0x8         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO164      0x10        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO165      0x20        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO166      0x40        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO167      0x80        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPFLOCK_GPIO168      0x100       // Configuration Lock bit for this
                                              // pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCR register
//
//*****************************************************************************
#define GPIO_GPFCR_GPIO160        0x1         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO161        0x2         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO162        0x4         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO163        0x8         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO164        0x10        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO165        0x20        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO166        0x40        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO167        0x80        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPFCR_GPIO168        0x100       // Configuration lock commit bit
                                              // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPADAT register
//
//*****************************************************************************
#define GPIO_GPADAT_GPIO0         0x1         // Data Register for this pin
#define GPIO_GPADAT_GPIO1         0x2         // Data Register for this pin
#define GPIO_GPADAT_GPIO2         0x4         // Data Register for this pin
#define GPIO_GPADAT_GPIO3         0x8         // Data Register for this pin
#define GPIO_GPADAT_GPIO4         0x10        // Data Register for this pin
#define GPIO_GPADAT_GPIO5         0x20        // Data Register for this pin
#define GPIO_GPADAT_GPIO6         0x40        // Data Register for this pin
#define GPIO_GPADAT_GPIO7         0x80        // Data Register for this pin
#define GPIO_GPADAT_GPIO8         0x100       // Data Register for this pin
#define GPIO_GPADAT_GPIO9         0x200       // Data Register for this pin
#define GPIO_GPADAT_GPIO10        0x400       // Data Register for this pin
#define GPIO_GPADAT_GPIO11        0x800       // Data Register for this pin
#define GPIO_GPADAT_GPIO12        0x1000      // Data Register for this pin
#define GPIO_GPADAT_GPIO13        0x2000      // Data Register for this pin
#define GPIO_GPADAT_GPIO14        0x4000      // Data Register for this pin
#define GPIO_GPADAT_GPIO15        0x8000      // Data Register for this pin
#define GPIO_GPADAT_GPIO16        0x10000     // Data Register for this pin
#define GPIO_GPADAT_GPIO17        0x20000     // Data Register for this pin
#define GPIO_GPADAT_GPIO18        0x40000     // Data Register for this pin
#define GPIO_GPADAT_GPIO19        0x80000     // Data Register for this pin
#define GPIO_GPADAT_GPIO20        0x100000    // Data Register for this pin
#define GPIO_GPADAT_GPIO21        0x200000    // Data Register for this pin
#define GPIO_GPADAT_GPIO22        0x400000    // Data Register for this pin
#define GPIO_GPADAT_GPIO23        0x800000    // Data Register for this pin
#define GPIO_GPADAT_GPIO24        0x1000000   // Data Register for this pin
#define GPIO_GPADAT_GPIO25        0x2000000   // Data Register for this pin
#define GPIO_GPADAT_GPIO26        0x4000000   // Data Register for this pin
#define GPIO_GPADAT_GPIO27        0x8000000   // Data Register for this pin
#define GPIO_GPADAT_GPIO28        0x10000000  // Data Register for this pin
#define GPIO_GPADAT_GPIO29        0x20000000  // Data Register for this pin
#define GPIO_GPADAT_GPIO30        0x40000000  // Data Register for this pin
#define GPIO_GPADAT_GPIO31        0x80000000  // Data Register for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPASET register
//
//*****************************************************************************
#define GPIO_GPASET_GPIO0         0x1         // Output Set bit for this pin
#define GPIO_GPASET_GPIO1         0x2         // Output Set bit for this pin
#define GPIO_GPASET_GPIO2         0x4         // Output Set bit for this pin
#define GPIO_GPASET_GPIO3         0x8         // Output Set bit for this pin
#define GPIO_GPASET_GPIO4         0x10        // Output Set bit for this pin
#define GPIO_GPASET_GPIO5         0x20        // Output Set bit for this pin
#define GPIO_GPASET_GPIO6         0x40        // Output Set bit for this pin
#define GPIO_GPASET_GPIO7         0x80        // Output Set bit for this pin
#define GPIO_GPASET_GPIO8         0x100       // Output Set bit for this pin
#define GPIO_GPASET_GPIO9         0x200       // Output Set bit for this pin
#define GPIO_GPASET_GPIO10        0x400       // Output Set bit for this pin
#define GPIO_GPASET_GPIO11        0x800       // Output Set bit for this pin
#define GPIO_GPASET_GPIO12        0x1000      // Output Set bit for this pin
#define GPIO_GPASET_GPIO13        0x2000      // Output Set bit for this pin
#define GPIO_GPASET_GPIO14        0x4000      // Output Set bit for this pin
#define GPIO_GPASET_GPIO15        0x8000      // Output Set bit for this pin
#define GPIO_GPASET_GPIO16        0x10000     // Output Set bit for this pin
#define GPIO_GPASET_GPIO17        0x20000     // Output Set bit for this pin
#define GPIO_GPASET_GPIO18        0x40000     // Output Set bit for this pin
#define GPIO_GPASET_GPIO19        0x80000     // Output Set bit for this pin
#define GPIO_GPASET_GPIO20        0x100000    // Output Set bit for this pin
#define GPIO_GPASET_GPIO21        0x200000    // Output Set bit for this pin
#define GPIO_GPASET_GPIO22        0x400000    // Output Set bit for this pin
#define GPIO_GPASET_GPIO23        0x800000    // Output Set bit for this pin
#define GPIO_GPASET_GPIO24        0x1000000   // Output Set bit for this pin
#define GPIO_GPASET_GPIO25        0x2000000   // Output Set bit for this pin
#define GPIO_GPASET_GPIO26        0x4000000   // Output Set bit for this pin
#define GPIO_GPASET_GPIO27        0x8000000   // Output Set bit for this pin
#define GPIO_GPASET_GPIO28        0x10000000  // Output Set bit for this pin
#define GPIO_GPASET_GPIO29        0x20000000  // Output Set bit for this pin
#define GPIO_GPASET_GPIO30        0x40000000  // Output Set bit for this pin
#define GPIO_GPASET_GPIO31        0x80000000  // Output Set bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPACLEAR register
//
//*****************************************************************************
#define GPIO_GPACLEAR_GPIO0       0x1         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO1       0x2         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO2       0x4         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO3       0x8         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO4       0x10        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO5       0x20        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO6       0x40        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO7       0x80        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO8       0x100       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO9       0x200       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO10      0x400       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO11      0x800       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO12      0x1000      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO13      0x2000      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO14      0x4000      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO15      0x8000      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO16      0x10000     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO17      0x20000     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO18      0x40000     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO19      0x80000     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO20      0x100000    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO21      0x200000    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO22      0x400000    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO23      0x800000    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO24      0x1000000   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO25      0x2000000   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO26      0x4000000   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO27      0x8000000   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO28      0x10000000  // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO29      0x20000000  // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO30      0x40000000  // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO31      0x80000000  // Output Clear bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPATOGGLE register
//
//*****************************************************************************
#define GPIO_GPATOGGLE_GPIO0      0x1         // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO1      0x2         // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO2      0x4         // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO3      0x8         // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO4      0x10        // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO5      0x20        // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO6      0x40        // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO7      0x80        // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO8      0x100       // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO9      0x200       // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO10     0x400       // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO11     0x800       // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO12     0x1000      // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO13     0x2000      // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO14     0x4000      // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO15     0x8000      // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO16     0x10000     // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO17     0x20000     // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO18     0x40000     // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO19     0x80000     // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO20     0x100000    // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO21     0x200000    // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO22     0x400000    // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO23     0x800000    // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO24     0x1000000   // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO25     0x2000000   // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO26     0x4000000   // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO27     0x8000000   // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO28     0x10000000  // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO29     0x20000000  // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO30     0x40000000  // Output Toggle bit for this pin
#define GPIO_GPATOGGLE_GPIO31     0x80000000  // Output Toggle bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBDAT register
//
//*****************************************************************************
#define GPIO_GPBDAT_GPIO32        0x1         // Data Register for this pin
#define GPIO_GPBDAT_GPIO33        0x2         // Data Register for this pin
#define GPIO_GPBDAT_GPIO34        0x4         // Data Register for this pin
#define GPIO_GPBDAT_GPIO35        0x8         // Data Register for this pin
#define GPIO_GPBDAT_GPIO36        0x10        // Data Register for this pin
#define GPIO_GPBDAT_GPIO37        0x20        // Data Register for this pin
#define GPIO_GPBDAT_GPIO38        0x40        // Data Register for this pin
#define GPIO_GPBDAT_GPIO39        0x80        // Data Register for this pin
#define GPIO_GPBDAT_GPIO40        0x100       // Data Register for this pin
#define GPIO_GPBDAT_GPIO41        0x200       // Data Register for this pin
#define GPIO_GPBDAT_GPIO42        0x400       // Data Register for this pin
#define GPIO_GPBDAT_GPIO43        0x800       // Data Register for this pin
#define GPIO_GPBDAT_GPIO44        0x1000      // Data Register for this pin
#define GPIO_GPBDAT_GPIO45        0x2000      // Data Register for this pin
#define GPIO_GPBDAT_GPIO46        0x4000      // Data Register for this pin
#define GPIO_GPBDAT_GPIO47        0x8000      // Data Register for this pin
#define GPIO_GPBDAT_GPIO48        0x10000     // Data Register for this pin
#define GPIO_GPBDAT_GPIO49        0x20000     // Data Register for this pin
#define GPIO_GPBDAT_GPIO50        0x40000     // Data Register for this pin
#define GPIO_GPBDAT_GPIO51        0x80000     // Data Register for this pin
#define GPIO_GPBDAT_GPIO52        0x100000    // Data Register for this pin
#define GPIO_GPBDAT_GPIO53        0x200000    // Data Register for this pin
#define GPIO_GPBDAT_GPIO54        0x400000    // Data Register for this pin
#define GPIO_GPBDAT_GPIO55        0x800000    // Data Register for this pin
#define GPIO_GPBDAT_GPIO56        0x1000000   // Data Register for this pin
#define GPIO_GPBDAT_GPIO57        0x2000000   // Data Register for this pin
#define GPIO_GPBDAT_GPIO58        0x4000000   // Data Register for this pin
#define GPIO_GPBDAT_GPIO59        0x8000000   // Data Register for this pin
#define GPIO_GPBDAT_GPIO60        0x10000000  // Data Register for this pin
#define GPIO_GPBDAT_GPIO61        0x20000000  // Data Register for this pin
#define GPIO_GPBDAT_GPIO62        0x40000000  // Data Register for this pin
#define GPIO_GPBDAT_GPIO63        0x80000000  // Data Register for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBSET register
//
//*****************************************************************************
#define GPIO_GPBSET_GPIO32        0x1         // Output Set bit for this pin
#define GPIO_GPBSET_GPIO33        0x2         // Output Set bit for this pin
#define GPIO_GPBSET_GPIO34        0x4         // Output Set bit for this pin
#define GPIO_GPBSET_GPIO35        0x8         // Output Set bit for this pin
#define GPIO_GPBSET_GPIO36        0x10        // Output Set bit for this pin
#define GPIO_GPBSET_GPIO37        0x20        // Output Set bit for this pin
#define GPIO_GPBSET_GPIO38        0x40        // Output Set bit for this pin
#define GPIO_GPBSET_GPIO39        0x80        // Output Set bit for this pin
#define GPIO_GPBSET_GPIO40        0x100       // Output Set bit for this pin
#define GPIO_GPBSET_GPIO41        0x200       // Output Set bit for this pin
#define GPIO_GPBSET_GPIO42        0x400       // Output Set bit for this pin
#define GPIO_GPBSET_GPIO43        0x800       // Output Set bit for this pin
#define GPIO_GPBSET_GPIO44        0x1000      // Output Set bit for this pin
#define GPIO_GPBSET_GPIO45        0x2000      // Output Set bit for this pin
#define GPIO_GPBSET_GPIO46        0x4000      // Output Set bit for this pin
#define GPIO_GPBSET_GPIO47        0x8000      // Output Set bit for this pin
#define GPIO_GPBSET_GPIO48        0x10000     // Output Set bit for this pin
#define GPIO_GPBSET_GPIO49        0x20000     // Output Set bit for this pin
#define GPIO_GPBSET_GPIO50        0x40000     // Output Set bit for this pin
#define GPIO_GPBSET_GPIO51        0x80000     // Output Set bit for this pin
#define GPIO_GPBSET_GPIO52        0x100000    // Output Set bit for this pin
#define GPIO_GPBSET_GPIO53        0x200000    // Output Set bit for this pin
#define GPIO_GPBSET_GPIO54        0x400000    // Output Set bit for this pin
#define GPIO_GPBSET_GPIO55        0x800000    // Output Set bit for this pin
#define GPIO_GPBSET_GPIO56        0x1000000   // Output Set bit for this pin
#define GPIO_GPBSET_GPIO57        0x2000000   // Output Set bit for this pin
#define GPIO_GPBSET_GPIO58        0x4000000   // Output Set bit for this pin
#define GPIO_GPBSET_GPIO59        0x8000000   // Output Set bit for this pin
#define GPIO_GPBSET_GPIO60        0x10000000  // Output Set bit for this pin
#define GPIO_GPBSET_GPIO61        0x20000000  // Output Set bit for this pin
#define GPIO_GPBSET_GPIO62        0x40000000  // Output Set bit for this pin
#define GPIO_GPBSET_GPIO63        0x80000000  // Output Set bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCLEAR register
//
//*****************************************************************************
#define GPIO_GPBCLEAR_GPIO32      0x1         // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO33      0x2         // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO34      0x4         // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO35      0x8         // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO36      0x10        // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO37      0x20        // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO38      0x40        // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO39      0x80        // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO40      0x100       // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO41      0x200       // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO42      0x400       // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO43      0x800       // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO44      0x1000      // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO45      0x2000      // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO46      0x4000      // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO47      0x8000      // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO48      0x10000     // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO49      0x20000     // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO50      0x40000     // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO51      0x80000     // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO52      0x100000    // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO53      0x200000    // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO54      0x400000    // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO55      0x800000    // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO56      0x1000000   // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO57      0x2000000   // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO58      0x4000000   // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO59      0x8000000   // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO60      0x10000000  // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO61      0x20000000  // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO62      0x40000000  // Output Clear bit for this pin
#define GPIO_GPBCLEAR_GPIO63      0x80000000  // Output Clear bit for this pin

