RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPBTOGGLE register
//
//*****************************************************************************
#define GPIO_GPBTOGGLE_GPIO32     0x1         // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO33     0x2         // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO34     0x4         // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO35     0x8         // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO36     0x10        // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO37     0x20        // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO38     0x40        // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO39     0x80        // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO40     0x100       // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO41     0x200       // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO42     0x400       // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO43     0x800       // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO44     0x1000      // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO45     0x2000      // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO46     0x4000      // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO47     0x8000      // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO48     0x10000     // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO49     0x20000     // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO50     0x40000     // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO51     0x80000     // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO52     0x100000    // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO53     0x200000    // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO54     0x400000    // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO55     0x800000    // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO56     0x1000000   // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO57     0x2000000   // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO58     0x4000000   // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO59     0x8000000   // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO60     0x10000000  // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO61     0x20000000  // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO62     0x40000000  // Output Toggle bit for this pin
#define GPIO_GPBTOGGLE_GPIO63     0x80000000  // Output Toggle bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCDAT register
//
//*****************************************************************************
#define GPIO_GPCDAT_GPIO64        0x1         // Data Register for this pin
#define GPIO_GPCDAT_GPIO65        0x2         // Data Register for this pin
#define GPIO_GPCDAT_GPIO66        0x4         // Data Register for this pin
#define GPIO_GPCDAT_GPIO67        0x8         // Data Register for this pin
#define GPIO_GPCDAT_GPIO68        0x10        // Data Register for this pin
#define GPIO_GPCDAT_GPIO69        0x20        // Data Register for this pin
#define GPIO_GPCDAT_GPIO70        0x40        // Data Register for this pin
#define GPIO_GPCDAT_GPIO71        0x80        // Data Register for this pin
#define GPIO_GPCDAT_GPIO72        0x100       // Data Register for this pin
#define GPIO_GPCDAT_GPIO73        0x200       // Data Register for this pin
#define GPIO_GPCDAT_GPIO74        0x400       // Data Register for this pin
#define GPIO_GPCDAT_GPIO75        0x800       // Data Register for this pin
#define GPIO_GPCDAT_GPIO76        0x1000      // Data Register for this pin
#define GPIO_GPCDAT_GPIO77        0x2000      // Data Register for this pin
#define GPIO_GPCDAT_GPIO78        0x4000      // Data Register for this pin
#define GPIO_GPCDAT_GPIO79        0x8000      // Data Register for this pin
#define GPIO_GPCDAT_GPIO80        0x10000     // Data Register for this pin
#define GPIO_GPCDAT_GPIO81        0x20000     // Data Register for this pin
#define GPIO_GPCDAT_GPIO82        0x40000     // Data Register for this pin
#define GPIO_GPCDAT_GPIO83        0x80000     // Data Register for this pin
#define GPIO_GPCDAT_GPIO84        0x100000    // Data Register for this pin
#define GPIO_GPCDAT_GPIO85        0x200000    // Data Register for this pin
#define GPIO_GPCDAT_GPIO86        0x400000    // Data Register for this pin
#define GPIO_GPCDAT_GPIO87        0x800000    // Data Register for this pin
#define GPIO_GPCDAT_GPIO88        0x1000000   // Data Register for this pin
#define GPIO_GPCDAT_GPIO89        0x2000000   // Data Register for this pin
#define GPIO_GPCDAT_GPIO90        0x4000000   // Data Register for this pin
#define GPIO_GPCDAT_GPIO91        0x8000000   // Data Register for this pin
#define GPIO_GPCDAT_GPIO92        0x10000000  // Data Register for this pin
#define GPIO_GPCDAT_GPIO93        0x20000000  // Data Register for this pin
#define GPIO_GPCDAT_GPIO94        0x40000000  // Data Register for this pin
#define GPIO_GPCDAT_GPIO95        0x80000000  // Data Register for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCSET register
//
//*****************************************************************************
#define GPIO_GPCSET_GPIO64        0x1         // Output Set bit for this pin
#define GPIO_GPCSET_GPIO65        0x2         // Output Set bit for this pin
#define GPIO_GPCSET_GPIO66        0x4         // Output Set bit for this pin
#define GPIO_GPCSET_GPIO67        0x8         // Output Set bit for this pin
#define GPIO_GPCSET_GPIO68        0x10        // Output Set bit for this pin
#define GPIO_GPCSET_GPIO69        0x20        // Output Set bit for this pin
#define GPIO_GPCSET_GPIO70        0x40        // Output Set bit for this pin
#define GPIO_GPCSET_GPIO71        0x80        // Output Set bit for this pin
#define GPIO_GPCSET_GPIO72        0x100       // Output Set bit for this pin
#define GPIO_GPCSET_GPIO73        0x200       // Output Set bit for this pin
#define GPIO_GPCSET_GPIO74        0x400       // Output Set bit for this pin
#define GPIO_GPCSET_GPIO75        0x800       // Output Set bit for this pin
#define GPIO_GPCSET_GPIO76        0x1000      // Output Set bit for this pin
#define GPIO_GPCSET_GPIO77        0x2000      // Output Set bit for this pin
#define GPIO_GPCSET_GPIO78        0x4000      // Output Set bit for this pin
#define GPIO_GPCSET_GPIO79        0x8000      // Output Set bit for this pin
#define GPIO_GPCSET_GPIO80        0x10000     // Output Set bit for this pin
#define GPIO_GPCSET_GPIO81        0x20000     // Output Set bit for this pin
#define GPIO_GPCSET_GPIO82        0x40000     // Output Set bit for this pin
#define GPIO_GPCSET_GPIO83        0x80000     // Output Set bit for this pin
#define GPIO_GPCSET_GPIO84        0x100000    // Output Set bit for this pin
#define GPIO_GPCSET_GPIO85        0x200000    // Output Set bit for this pin
#define GPIO_GPCSET_GPIO86        0x400000    // Output Set bit for this pin
#define GPIO_GPCSET_GPIO87        0x800000    // Output Set bit for this pin
#define GPIO_GPCSET_GPIO88        0x1000000   // Output Set bit for this pin
#define GPIO_GPCSET_GPIO89        0x2000000   // Output Set bit for this pin
#define GPIO_GPCSET_GPIO90        0x4000000   // Output Set bit for this pin
#define GPIO_GPCSET_GPIO91        0x8000000   // Output Set bit for this pin
#define GPIO_GPCSET_GPIO92        0x10000000  // Output Set bit for this pin
#define GPIO_GPCSET_GPIO93        0x20000000  // Output Set bit for this pin
#define GPIO_GPCSET_GPIO94        0x40000000  // Output Set bit for this pin
#define GPIO_GPCSET_GPIO95        0x80000000  // Output Set bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCLEAR register
//
//*****************************************************************************
#define GPIO_GPCCLEAR_GPIO64      0x1         // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO65      0x2         // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO66      0x4         // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO67      0x8         // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO68      0x10        // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO69      0x20        // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO70      0x40        // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO71      0x80        // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO72      0x100       // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO73      0x200       // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO74      0x400       // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO75      0x800       // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO76      0x1000      // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO77      0x2000      // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO78      0x4000      // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO79      0x8000      // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO80      0x10000     // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO81      0x20000     // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO82      0x40000     // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO83      0x80000     // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO84      0x100000    // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO85      0x200000    // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO86      0x400000    // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO87      0x800000    // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO88      0x1000000   // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO89      0x2000000   // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO90      0x4000000   // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO91      0x8000000   // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO92      0x10000000  // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO93      0x20000000  // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO94      0x40000000  // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO95      0x80000000  // Output Clear bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCTOGGLE register
//
//*****************************************************************************
#define GPIO_GPCTOGGLE_GPIO64     0x1         // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO65     0x2         // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO66     0x4         // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO67     0x8         // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO68     0x10        // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO69     0x20        // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO70     0x40        // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO71     0x80        // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO72     0x100       // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO73     0x200       // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO74     0x400       // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO75     0x800       // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO76     0x1000      // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO77     0x2000      // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO78     0x4000      // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO79     0x8000      // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO80     0x10000     // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO81     0x20000     // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO82     0x40000     // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO83     0x80000     // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO84     0x100000    // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO85     0x200000    // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO86     0x400000    // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO87     0x800000    // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO88     0x1000000   // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO89     0x2000000   // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO90     0x4000000   // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO91     0x8000000   // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO92     0x10000000  // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO93     0x20000000  // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO94     0x40000000  // Output Toggle bit for this pin
#define GPIO_GPCTOGGLE_GPIO95     0x80000000  // Output Toggle bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDDAT register
//
//*****************************************************************************
#define GPIO_GPDDAT_GPIO96        0x1         // Data Register for this pin
#define GPIO_GPDDAT_GPIO97        0x2         // Data Register for this pin
#define GPIO_GPDDAT_GPIO98        0x4         // Data Register for this pin
#define GPIO_GPDDAT_GPIO99        0x8         // Data Register for this pin
#define GPIO_GPDDAT_GPIO100       0x10        // Data Register for this pin
#define GPIO_GPDDAT_GPIO101       0x20        // Data Register for this pin
#define GPIO_GPDDAT_GPIO102       0x40        // Data Register for this pin
#define GPIO_GPDDAT_GPIO103       0x80        // Data Register for this pin
#define GPIO_GPDDAT_GPIO104       0x100       // Data Register for this pin
#define GPIO_GPDDAT_GPIO105       0x200       // Data Register for this pin
#define GPIO_GPDDAT_GPIO106       0x400       // Data Register for this pin
#define GPIO_GPDDAT_GPIO107       0x800       // Data Register for this pin
#define GPIO_GPDDAT_GPIO108       0x1000      // Data Register for this pin
#define GPIO_GPDDAT_GPIO109       0x2000      // Data Register for this pin
#define GPIO_GPDDAT_GPIO110       0x4000      // Data Register for this pin
#define GPIO_GPDDAT_GPIO111       0x8000      // Data Register for this pin
#define GPIO_GPDDAT_GPIO112       0x10000     // Data Register for this pin
#define GPIO_GPDDAT_GPIO113       0x20000     // Data Register for this pin
#define GPIO_GPDDAT_GPIO114       0x40000     // Data Register for this pin
#define GPIO_GPDDAT_GPIO115       0x80000     // Data Register for this pin
#define GPIO_GPDDAT_GPIO116       0x100000    // Data Register for this pin
#define GPIO_GPDDAT_GPIO117       0x200000    // Data Register for this pin
#define GPIO_GPDDAT_GPIO118       0x400000    // Data Register for this pin
#define GPIO_GPDDAT_GPIO119       0x800000    // Data Register for this pin
#define GPIO_GPDDAT_GPIO120       0x1000000   // Data Register for this pin
#define GPIO_GPDDAT_GPIO121       0x2000000   // Data Register for this pin
#define GPIO_GPDDAT_GPIO122       0x4000000   // Data Register for this pin
#define GPIO_GPDDAT_GPIO123       0x8000000   // Data Register for this pin
#define GPIO_GPDDAT_GPIO124       0x10000000  // Data Register for this pin
#define GPIO_GPDDAT_GPIO125       0x20000000  // Data Register for this pin
#define GPIO_GPDDAT_GPIO126       0x40000000  // Data Register for this pin
#define GPIO_GPDDAT_GPIO127       0x80000000  // Data Register for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDSET register
//
//*****************************************************************************
#define GPIO_GPDSET_GPIO96        0x1         // Output Set bit for this pin
#define GPIO_GPDSET_GPIO97        0x2         // Output Set bit for this pin
#define GPIO_GPDSET_GPIO98        0x4         // Output Set bit for this pin
#define GPIO_GPDSET_GPIO99        0x8         // Output Set bit for this pin
#define GPIO_GPDSET_GPIO100       0x10        // Output Set bit for this pin
#define GPIO_GPDSET_GPIO101       0x20        // Output Set bit for this pin
#define GPIO_GPDSET_GPIO102       0x40        // Output Set bit for this pin
#define GPIO_GPDSET_GPIO103       0x80        // Output Set bit for this pin
#define GPIO_GPDSET_GPIO104       0x100       // Output Set bit for this pin
#define GPIO_GPDSET_GPIO105       0x200       // Output Set bit for this pin
#define GPIO_GPDSET_GPIO106       0x400       // Output Set bit for this pin
#define GPIO_GPDSET_GPIO107       0x800       // Output Set bit for this pin
#define GPIO_GPDSET_GPIO108       0x1000      // Output Set bit for this pin
#define GPIO_GPDSET_GPIO109       0x2000      // Output Set bit for this pin
#define GPIO_GPDSET_GPIO110       0x4000      // Output Set bit for this pin
#define GPIO_GPDSET_GPIO111       0x8000      // Output Set bit for this pin
#define GPIO_GPDSET_GPIO112       0x10000     // Output Set bit for this pin
#define GPIO_GPDSET_GPIO113       0x20000     // Output Set bit for this pin
#define GPIO_GPDSET_GPIO114       0x40000     // Output Set bit for this pin
#define GPIO_GPDSET_GPIO115       0x80000     // Output Set bit for this pin
#define GPIO_GPDSET_GPIO116       0x100000    // Output Set bit for this pin
#define GPIO_GPDSET_GPIO117       0x200000    // Output Set bit for this pin
#define GPIO_GPDSET_GPIO118       0x400000    // Output Set bit for this pin
#define GPIO_GPDSET_GPIO119       0x800000    // Output Set bit for this pin
#define GPIO_GPDSET_GPIO120       0x1000000   // Output Set bit for this pin
#define GPIO_GPDSET_GPIO121       0x2000000   // Output Set bit for this pin
#define GPIO_GPDSET_GPIO122       0x4000000   // Output Set bit for this pin
#define GPIO_GPDSET_GPIO123       0x8000000   // Output Set bit for this pin
#define GPIO_GPDSET_GPIO124       0x10000000  // Output Set bit for this pin
#define GPIO_GPDSET_GPIO125       0x20000000  // Output Set bit for this pin
#define GPIO_GPDSET_GPIO126       0x40000000  // Output Set bit for this pin
#define GPIO_GPDSET_GPIO127       0x80000000  // Output Set bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDCLEAR register
//
//*****************************************************************************
#define GPIO_GPDCLEAR_GPIO96      0x1         // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO97      0x2         // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO98      0x4         // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO99      0x8         // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO100     0x10        // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO101     0x20        // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO102     0x40        // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO103     0x80        // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO104     0x100       // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO105     0x200       // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO106     0x400       // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO107     0x800       // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO108     0x1000      // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO109     0x2000      // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO110     0x4000      // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO111     0x8000      // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO112     0x10000     // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO113     0x20000     // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO114     0x40000     // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO115     0x80000     // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO116     0x100000    // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO117     0x200000    // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO118     0x400000    // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO119     0x800000    // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO120     0x1000000   // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO121     0x2000000   // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO122     0x4000000   // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO123     0x8000000   // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO124     0x10000000  // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO125     0x20000000  // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO126     0x40000000  // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO127     0x80000000  // Output Clear bit for this pin

